#!/bin/bash
export lang=ja_jp.utf-8

: "終了時クリンナップ" && {
	# 作業用一時ディレクトリの後始末用関数とトラップ設定
	function cleanup_tmpdir() {
		:
	}
	trap cleanup_tmpdir INT
	trap cleanup_tmpdir EXIT
}

: ”初期チェック” && {
	#GUN Awkがインストール済みであることを確認する
	if [[ $(gawk --virsion > /dev/null 2>&1 ) =~ 'GNU Awk' ]] ; then
			echo "警告: gun版awk が見つかりません。gun版awk をインストールしてください。" >&2
			return 1
	fi

	declare tgtFile="$(basename "${1}")"   #引数で指定されたファイルを対象とする
	if [[ "${tgtFile/ /}" = '' ]];then
		echo "💩変換元ファイルを指定してください"
		exit 1
	fi

	if [[ ! -e "${tgtFile}" ]]; then
		echo "💩 ${tgtFile}なんてファイルいないです"
		exit 1
	fi

	convMode="${2}"  #'-t2h'でtxt→html、'-h2t'でhtml→txt、それ以外は今の所はエラー

	if [[ "${convMode}" != '' ]] && [[ "${convMode}" != '-t' ]] ; then
		echo "💩 引数1は、無し(txt→html)か、-t(html→txt)で指定してください"
		exit 1
	fi
}

: "初期処理" && {
	# 文字コード確認・変換、作業ディレクトリ、ファイルの定義
	chrset="$(file -i ${tgtFile})"

	SCRIPT_DIR=$(cd $(dirname $0); pwd)

	# 対象ファイルの文字コードを確認し、unknown-8bit(SJIS)ならUTF-8に変換する
	if [[ "${chrset##*charset=}" != 'utf-8' ]] ; then
		echo '入力ファイルのcharset(文字コード)がUTF-8ではありません。処理は続行しますが、変換結果を保証しません。'
		echo '※  ファイル内に日本語文字が一つも含まれていない場合、正しくUTF-8であってもこの警告が表示される可能性があります'
	fi
}

: "txt→html変換処理" && {
	# if [[ "${convMode}" = '-t2h' ]]; then
		## txt→html ############################################################################################

		destFile="${tgtFile/'.txt'/'_tagged.html'}" #出力ファイルの指定する
		printf '' > "${destFile}"

	: "警告表示" && {
		##警告表示####################################################################
		# 変換不能なケースを予め抽出する。
		# 処理は中断せず最後まで行うが、警告表示を行う。
		# おそらく変換処理は成功しない。
		##############################################################################
		# ルビ指定に傍点の同時指定
		# ｜《》の全体か母字部分かのどちらかに、《《》》指定が入れ子されている※ルビ文字部分への特殊指定は後続でチェックしている
		grep -E -o -n '｜[^《]*《《[^》]+》》《[^》]+》|《《[^｜]*｜[^《]+《[^》]+》[^》]*》》' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑でルビと傍点が同時に設定されています。不適切な指定です。変換結果は保証されません。' 
		fi
		#2文字以上に回転指定
		grep -E -o -n '\[\^[^\^]{2,}\^\]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑で2文字以上の範囲に回転が設定されています。不適切な指定です。変換結果は保証されません。' 
		fi
		#ルビ全体への回転指定※母字のみあるいはルビ文字のみは許容する
		grep -E -o -n '\[\^[^｜]*｜[^《]*《《[^》]+》》[^\^]*\^\]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑でルビと回転が同時に指定されています。不適切な指定です。変換結果は保証されません。' 
		fi
		#ルビ指定全体への縦中横※母字のみあるいはルビ文字のみは許容する
		grep -E -o -n '\^[^｜]*｜[^《]*《《[^》]+》》[^\^]*\^' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑でルビ指定全体への縦中横が指定されています。不適切な指定です。変換結果は保証されません。' 
		fi
		# 縦中横の中に半角英数記号以外(文字コード上「半角スペース」〜「~」の領域)が含まれている
		# ただし、縦中横全体への太字と傍点はは許容するため、《》*もこれらに含めない。
		grep -E -o -n '\^[^\^]*[^ -~《》]+[^\^]*\^' "${tgtFile}" >"${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑で縦中横の中に半角英数文字以外が含まれています。この変換は非対応です。変換は実施しますが結果は保証されません。' 
		fi
		# 縦中横指定の一部に太字指定
		# 縦中横指定^文字^の中に、**と**で括られていない文字が1文字以上ある
		grep -E -o -n '\^[^\*]+\*\*[^\*]+\*\*\^|\^\*\*[^\*]+\*\*[^\*]+\^' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑で縦中横の一部にだけ太字が指定されています。この変換は非対応です。変換結果は保証されません。' 
		fi
		# 4文字以上の縦中横()
		# ただし、縦中横全体への太字と傍点はは許容するため、《》*もこれらに含めない。
		grep -E -o -n '\^(\*\*)*[^\*《》]{4,}(\*\*)*\^' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑で4桁以上の縦中横が指定されています。この変換は非対応です。変換は実施しますが結果は保証されません。' 
		fi
		# 縦中横指定の一部にのみ傍点指定
		grep -E -o -n '\^[^《]+《《[^》]+》》\^|\^《《[^》]+》》[^》]+\^' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑で縦中横の一部にだけ傍点が指定されています。不適切な指定です。変換は実施しますが結果は保証されません。' 
		fi
		# ルビ指定全体に回転指定
		grep -E -o -n '\[\^｜[^《]+《[^》]+》\^\]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑でルビ指定の全体に回転が指定されています。不適切な指定です。変換は実施しますが結果は保証されません。' 
		fi
		# 強制合字の指定が2文字ではない
		# 1文字か、3文字以上は駄目
		grep -E -o -n '\[l\[[^\]\]r\]|\[l\[[^\]{3}\]r\]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑で強制合字には2文字だけを指定してください。この変換は非対応です。変換は実施しますが結果は保証されません。' 
		fi
		# アへ濁点に回転指定
		grep -E -o -n '\[\^.゛\^\]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑で強制濁点に回転が指定されています。この変換は非対応です。変換は実施しますが結果は保証されません。' 
		fi
		# ルビ文字に特殊指定
		## ルビ文字にルビ
		grep -E -o -n '｜[^《]+《[^｜]*｜[^《]+《[^》]+》[^》]*》' "${tgtFile}" > "${destFile}"
		## ルビ文字に太字
		grep -E -o -n '｜[^《]+《[^《]*《《[^》]+》》[^》]*》' "${tgtFile}" >> "${destFile}"
		## ルビ文字に回転
		grep -E -o -n '｜[^《]+《[^\[]*\[\^\[^\^]\^\][^》]*》' "${tgtFile}" >> "${destFile}"
		## ルビ文字に合字
		grep -E -o -n '｜[^《]+《[^[]*[l[[^]]{2}]r][^》]*》' "${tgtFile}" >> "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑でルビ文字に修飾が指定されています。この変換は非対応です。変換は実施しますが結果は保証されません。' 
		fi
		# 不要なスペース(改行直前のスペース、閉じ括弧直前のスペース)
		grep -E -o -n '[ 　]$|[ 　]([」』）〟])|^(§+)[ 　]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑に不要なスペース(改行直前のスペース、閉じ括弧直前のスペース、セクション記号直後のスペース)が含まれています。'
			echo '内部的に除去して変換を実施します（元ファイルは修正しませんが、修正が必要な箇所です）。'
		fi
		#組版時に置換される記号類
		##表記ゆれする可能性がある記号の統一
		grep -E -o -n '[♡♥☆□♫♬]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑に含まれる記号は変換後、別の記号に置換されます。（元ファイルは修正しません）'
		fi
		##組版時に置換される連続「―」
		grep -E -o -n '―{2,}' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑に含まれる、連続する「―」は、倍サイズの一つの「―」へ変換されます(元ファイルは修正しません)'
		fi
		##！？のペア
		grep -E -o -n '！！|！？|？！|？？' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑に含まれる、！!、！？などのペアは変換後、１文字幅に収まるように半角のペアに変換されます(元のファイルは修正しません)'
		fi
		grep -E -o -n '^(§+)[ 　]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑に含まれる、！!、！？などのペアは変換後、１文字幅に収まるように半角のペアに変換されます(元のファイルは修正しません)'
		fi
		grep -E -o -n '^$' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑に含まれる空行は、元ファイルの記述に関わらず、変換規則に則って削除あるいは追加されます(元のファイルは修正しません)'
		fi
		# 記号類の直後のスペース
		grep -E -o -n '[!\?！？❤💞💕♪☆★💢]+　*[^」』）!\?！？❤💞💕♪☆★💢]' "${tgtFile}" > "${destFile}"
		if [[ -s "${destFile}" ]]; then 
			cat "${destFile}"
			echo '🤔 ↑記号類の直後に、それが連続するか行末・括弧内末尾でない限り、スペースを挿入します(元のファイルは修正しません)'
		fi

	}

	: "変換実施" && {
		#awkスクリプトを実行
   awk -f "${SCRIPT_DIR}/littlebug.awk" "${tgtFile}" > "${destFile}"

	}

	echo "✨ "${destFile}"を出力しました[html化]"

}

# elif [[ "${convMode}" = '-h2t' ]]; then
#   ## html→txt ############################################################################################

#   destFile=${tgtFile_AfterCD/".html"/"_removed.txt"} #出力ファイルの指定する
#   touch ${destFile}                          #出力先ファイルを生成

#   ## littlebugXX.cssの読み込みを除去する
#   cat ${tgtFile_AfterCD} \
#   | sed -z 's/<link rel=\"stylesheet\" href=\".\+littlebug.\+css\">//' \
#   | sed -z 's/<link rel=\"preconnect\" href=\"https:\/\/fonts\.googleapis\.com\">\n//' \
#   | sed -z 's/<link rel=\"preconnect\" href=\"https:\/\/fonts\.gstatic\.com\" crossorigin>\n//' \
#   | sed -z 's/<link href=\"https:\/\/fonts\.googleapis\.com\/css2\?family=Noto\+Serif\+JP:wght\@300\&display=swap\" rel=\"stylesheet">\n//' \
#   >tmp1_ltlbgtmp
	
#   ############################################################################################
#   #入れ子構造になりうるタグの復旧1。外側。修飾は最大3なので、復旧処理を3回反復する
#   ############################################################################################
#   for i in $(seq 0 2); do
#     ############################################################################################
#     #入れ子構造になりうるタグの復旧2。内側。修飾は最大3なので、復旧処理を3回反復する
#     ############################################################################################
#     for i in $(seq 0 2); do
#       ## 章区切りを[chapter:XXXX]に
#       ### 閉じタグ</section><!--ltlbg_section-->を除去
#       ### <section class="ltlbg_section" id="XXX">を[chapter:]へ
#       cat tmp1_ltlbgtmp \
#       | sed -e 's/<\/section><!--ltlbg_section-->//g' \
#       | sed -e 's/<section class="ltlbg_section">/[chapter]/g' \
#       | sed -e 's/<section class="ltlbg_section" id="\([^"]\+\)">/[chapter:\1]/g' \
#       | sed -e 's/\[chapter:\]/\[chapter\]/g' \
#       >tmp2_ltlbgtmp

#       ## 閉じpタグを消し、pタグを全角空白へ置換する
#       ## 全角空白直後の改行は削除する(元のpタグが直後に改行しているため)
#       cat tmp2_ltlbgtmp \
#       | sed -e 's/<\/p><!--ltlbg_p-->//g' \
#       | sed -e 's/<p class="ltlbg_p">/<span class="ltlbg_wSp"><\/span>/g' \
#       | sed -z 's/<span class="ltlbg_wSp"><\/span>\n<span class="ltlbg_talk">/\n<span class="ltlbg_talk">/g' \
#       >tmp1_ltlbgtmp

#       ## 括弧類を復旧
#       cat tmp1_ltlbgtmp \
#       | sed -e 's/<\/span><!--ltlbg_talk-->/」/g' \
#       | sed -e 's/<\/span><!--ltlbg_talk2-->/』/g' \
#       | sed -e 's/<\/span><!--ltlbg_think-->/）/g' \
#       | sed -e 's/<\/span><!--ltlbg_wquote-->/〟/g' \
#       | sed -e 's/<\/span><!--ltlbg_dash-->//g' \
#       | sed -e 's/<\/span><!--ltlbg_citation-->//g' \
#       | sed -e 's/<span class="ltlbg_talk">/「/g' \
#       | sed -e 's/<span class="ltlbg_talk2">/『/g' \
#       | sed -e 's/<span class="ltlbg_think">/（/g' \
#       | sed -e 's/<span class="ltlbg_wquote">/〝/g' \
#       | sed -e 's/<span class="ltlbg_dash">/――/g' \
#       | sed -e 's/<span class="ltlbg_citation">/＞/g' \
#       >tmp2_ltlbgtmp

#       ## 縦中横と横幅修正を除去
#       cat tmp2_ltlbgtmp \
#       | sed -e 's/<span class=\"ltlbg_tcyA\">\([^<]\{2\}\)<\/span>/\1/g' \
#       | sed -e 's/<span class=\"ltlbg_wdfix\">\([^<]\)<\/span>/\1/g' \
#       >tmp1_ltlbgtmp

#       ## コロンとセミコロンを復旧
#       cat tmp1_ltlbgtmp \
#       | sed -e 's/<span class="ltlbg_semicolon">；<\/span>/；/g' \
#       | sed -e 's/<span class="ltlbg_colon">：<\/span>/：/g' \
#       >tmp2_ltlbgtmp

#       ## 括弧類の擬似段落記号を除去
#       cat tmp2_ltlbgtmp \
#       | sed -e 's/<p class="ltlbg_p_brctGrp">//g' \
#       | sed -e 's/<\/p><\!--ltlbg_p_brctGrp-->//g' \
#       >tmp1_ltlbgtmp

#       ## <span class="ltlbg_dakuten">を「゛」に復旧
#       ## <span class="ltlbg_tcyM">XX</span>を復旧
#       ## <span class="ltlbg_wSize">字</span>を復旧
#       ## <span class="ltlbg_odori1"></span><span class="ltlbg_odori2"></span>を復旧
#       cat tmp1_ltlbgtmp \
#       | sed -e 's/<span class=\"ltlbg_dakuten\">\(.\)<\/span>/\1゛/g' \
#       | sed -e 's/<span class=\"ltlbg_tcyM\">\([^<]\{1,3\}\)<\/span>/^\1^/g' \
#       | sed -e 's/<span class=\"ltlbg_wSize\">\(.\)<\/span>/\1\1/g' \
#       | sed -e 's/<span class=\"ltlbg_odori1\"><\/span>/／/g' \
#       | sed -e 's/<span class=\"ltlbg_odori2\"><\/span>/＼/g' \
#       >tmp2_ltlbgtmp

#       ## 強制合字<span class="ltlbg_forceGouji1">、<span class="ltlbg_forceGouji2">を[l[]r]へ復旧
#       cat tmp2_ltlbgtmp \
#       | sed -e 's/<span class=\"ltlbg_forceGouji1\">\(.\)<\/span><span class=\"ltlbg_forceGouji2\">\(.\)<\/span>/[l[\1\2]r]/g' \
#       >tmp1_ltlbgtmp

#       ## 回転指定<span class="ltlbg_rotate"></span>を[^字^]へ復旧
#       ## 太字指定<span class="ltlbg_bold"></span>を**字**へ復旧
#       cat tmp1_ltlbgtmp \
#       | sed -e 's/<span class=\"ltlbg_rotate\">\(.\)<\/span>/\[\^\1\^\]/g' \
#       | sed -e 's/<span class=\"ltlbg_bold\">\([^<]\+\)<\/span>/\*\*\1\*\*/g' \
#       >tmp2_ltlbgtmp

#       ## <h2 class="ltlbg_sectionName">\1<\/h2>を行頭◆へ
#       ## <hr class="ltlbg_hr">を---へ。
#       cat tmp2_ltlbgtmp \
#       | sed -e 's/<h2 class=\"ltlbg_sectionName\">\([^<]\+\)<\/h2>/\1/g' \
#       | sed -e 's/<hr class=\"ltlbg_hr\">/---/g' \
#       >tmp1_ltlbgtmp

#       ## モノルビを復旧
#       cat tmp1_ltlbgtmp >tmp2_ltlbgtmp
#       #3回繰り返すのでループ末尾で出力している中間ファイルから開始されるよう調整する
#       cat tmp2_ltlbgtmp >tmp1_ltlbgtmp
#     done

#     ############################################################################################
#     #複数回の置換を必要としない(途中で戻ると不都合のある)復旧
#     ############################################################################################
#     ## 「&lt;」  を「<」(半角)へ変換
#     ## 「&gt;」  を「>」(半角)へ変換
#     ## 「&amp;」 を「&」(半角)へ変換
#     ## 「&quot;」を「'」(半角)へ変換
#     ## 「&#39;」 を「"」(半角)へ変換
#     cat tmp2_ltlbgtmp \
#     | sed -e 's/&amp;/\&/g' \
#     | sed -e 's/&lt;/</g' \
#     | sed -e 's/&gt;/>/g' \
#     | sed -e 's/&quot;/'\''/g' \
#     | sed -e 's/&#39;/\"/g' \
#     >tmp1_ltlbgtmp

#     ## ここまで生じているハード空行は副産物なので削除
#     ## その上で、<br class="ltlbg_br">、<br class="ltlbg_blankline">を削除
#     cat tmp1_ltlbgtmp \
#     | sed -z 's/^\n//g' \
#     | sed -e 's/<br class=\"ltlbg_br\">//g' \
#     | sed -e 's/^<br class=\"ltlbg_blankline\">//g' \
#     | sed -e 's/<span class=\"ltlbg_wSp\"><\/span>/　/g' \
#     | sed -e 's/<span class=\"ltlbg_sSp\"><\/span>/ /g' \
#     | sed -z 's/　\n/\n/g' \
#     >tmp2_ltlbgtmp

#     #################################################################################
#     #ルビと傍点の復旧は最後。傍点とモノルビは特殊な戻し作業を要する。
#     #################################################################################
#     ## モノルビ以外の<span class="ltlbg_ruby" data-ruby_XXX="XXX"></span>を復旧
#     cat tmp2_ltlbgtmp \
#     | sed -e 's/<ruby class="ltlbg_ruby" data-ruby_[^=]\+="\([^"]\+\)">\([^<]\+\)<rt>[^<]\+<\/rt><\/ruby>/{\2｜\1}/g' \
#     >tmp1_ltlbgtmp

#     #順序の入れ替え
#     cat tmp1_ltlbgtmp \
#     | sed -e 's/\*\*{\([^｜]\+\)｜\([^\}]\+\)}\*\*/{\*\*\1\*\*｜\2}/g' \
#     > tmp2_ltlbgtmp

#     ## 傍点タグを《《基底文字》》へ復旧する
#     ## <ruby class=\"ltlbg_emphasis\" data-ruby_emphasis=\"[^]]\">〜で抽出したものを置換元とする。
#     ## 基底文字だけを持つ中間ファイルと、ルビだけを持つ中間ファイルを作成し、置換先とする。
#     ## 置換機能を持った中間シェルスクリプトを作成し、実行する。
#     cat tmp2_ltlbgtmp \
#     | sed -e 's/<ruby class=\"ltlbg_emphasis\" data-emphasis=\".\">\([^<]\+\)<rt>.<\/rt><\/ruby>/《《\1》》/g' \
#     >tmp1_ltlbgtmp

#     #3回繰り返すのでループ末尾で出力している中間ファイルから開始されるよう調整する
#     #cat tmp2_ltlbgtmp >tmp1_ltlbgtmp
#   done
#   # ループ終了後の結果もtmp1_ltlbgtmpに出力される

#   # モノルビ対応。#######################################################
#   # モノルビは、ここまでの処理では{モノルビ｜ものるび}ではなく
#   # {モ｜も}{ノ｜の}{ル｜る}{ビ｜び}となっているのでこれを復旧する。
#   # 入力はtmp1_ltlbgtmpの想定。
#   #######################################################################
#   #cat tmp2_ltlbgtmp >tmp1_ltlbgtmp
#   cat tmp1_ltlbgtmp >monorubyInput_ltlbgtmp 

#   cat monorubyInput_ltlbgtmp \
#   | grep -E -o '(\{[^｜]+｜[^}]+\}){2,}' \
#   | uniq \
#   | sed -e 's/\//\\\//g' \
#   | sed -e 's/\[/\\\[/g' \
#   | sed -e 's/\]/\\\]/g' \
#   | sed -e 's/\^/\\\^/g' \
#   | sed -e 's/\~/\\\~/g' \
#   | sed -e 's/\*/\\\*/g' \
#   | sed -e 's/\"/\\\"/g' \
#   > tgt_ltlbgtmp

#   if [ -s tgt_ltlbgtmp ]; then
#     cat tgt_ltlbgtmp \
#     | while read line || [ -n "${line}" ]; do \
#         echo ${line} \
#         | grep -E -o '\{[^｜]+｜' \
#         | sed -e 's/^{//g' \
#         | sed -e 's/｜$//g' \
#         | sed -z 's/\n//g' \
#         | sed -e 's/^/\{/g' \
#             | sed -e 's/\//\\\//g' \
#             | sed -e 's/\[/\\\[/g' \
#             | sed -e 's/\]/\\\]/g' \
#             | sed -e 's/\^/\\\^/g' \
#             | sed -e 's/\~/\\\~/g' \
#             | sed -e 's/\*/\\\*/g' \
#             | sed -e 's/\"/\\\"/g' \

#         echo -n '｜'

#         echo ${line} \
#         | grep -E -o '｜[^}]+\}' \
#         | sed -e 's/^｜//g' \
#         | sed -e 's/}$//g' \
#         | sed -z 's/\n//g' \
#         | sed -e 's/$/\}/g' \
#             | sed -e 's/\//\\\//g' \
#             | sed -e 's/\[/\\\[/g' \
#             | sed -e 's/\]/\\\]/g' \
#             | sed -e 's/\^/\\\^/g' \
#             | sed -e 's/\~/\\\~/g' \
#             | sed -e 's/\*/\\\*/g' \
#             | sed -e 's/\"/\\\"/g' \

#         echo ''
#     done \
#     > rep_ltlbgtmp

#     paste -d '/' tgt_ltlbgtmp rep_ltlbgtmp \
#     | sed -e 's/^/| sed -e '\''s\//g' \
#     | sed -e 's/$/\/g'\'' \\/g' \
#     | sed -z 's/^/cat monorubyInput_ltlbgtmp \\\n/g' \
#     > tmp.sh
#     bash tmp.sh >monorubyOutput_ltlbgtmp
#   else 
#     cat monorubyInput_ltlbgtmp >monorubyOutput_ltlbgtmp
#   fi
#   cat monorubyOutput_ltlbgtmp >tmp1_ltlbgtmp
#   ########################モノルビ対応ここまで。出力はtmp1_ltlbgtmp

#   #傍点対応#################################################################################
#   # 傍点は1字ずつ設定されているのでここまでの処理では
#   # 《モノルビ》ではなく《モ》《ノ》《ル》《ルビ》となっているのでこれを復旧する
#   # 入力はtmp1_ltlbgtmpの想定
#   ##########################################################################################
#   #cat tmp2_ltlbgtmp >tmp1_ltlbgtmp
#   cat tmp1_ltlbgtmp >emphasisInput_ltlbgtmp 
#   cat emphasisInput_ltlbgtmp \
#   | grep -E -o '(《《[^》]+》》[ 　]?){2,}' \
#   | uniq \
#   >emphtmp_ltlbgtmp

#   #《《》》が連続している(複数文字の傍点)が存在しなければ実施しない
#   if [[ -s emphtmp_ltlbgtmp ]]; then 
#     cat emphtmp_ltlbgtmp \
#     | sed -e 's/\//\\\//g' \
#     | sed -e 's/\[/\\\[/g' \
#     | sed -e 's/\]/\\\]/g' \
#     | sed -e 's/\^/\\\^/g' \
#     | sed -e 's/\~/\\\~/g' \
#     | sed -e 's/\*/\\\*/g' \
#     | sed -e 's/\"/\\\"/g' \
#     | sed -e 's/^/| sed -e '\''s\//g' \
#     >tgt_ltlbgtmp

#     cat emphtmp_ltlbgtmp \
#     | sed -e 's/[《》]//g' \
#     | sed -e 's/^/《《/g' \
#     | sed -e 's/$/》》/g' \
#     | sed -e 's/$/\/g'\'' \\/g' \
#     >rep_ltlbgtmp

#     paste -d '/t' tgt_ltlbgtmp rep_ltlbgtmp \
#     | sed -z 's/^/cat emphasisInput_ltlbgtmp \\\n/g' \
#     >tmp.sh
#     bash tmp.sh > emphasisOutput_ltlbgtmp
#   else
#     cat emphasisInput_ltlbgtmp >emphasisOutput_ltlbgtmp
#   fi

#   cat emphasisOutput_ltlbgtmp >tmp1_ltlbgtmp
#   ########################傍点対応ここまで。出力はtmp1_ltlbgtmpの想定

#   cat tmp1_ltlbgtmp >${destFile}
#   echo "✨ "${destFile}"を出力しました[txtもどし]"
# fi
exit 0
